dionisioc58/hubbi-loger-usb/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# O USB nativo do ESP32-S3 sera usado como host.
CONFIG_USB_OTG_SUPPORTED=y

# O S3 tem um unico PHY USB interno, disputado pelo controlador USB Serial/JTAG
# e pelo USB-OTG. Como o OTG e quem vai atuar como host, o console secundario
# pela USB nativa precisa ficar desligado, senao os dois brigam pelo PHY.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Console local da logger, para depuracao e monitoramento: UART0 -> CH343 -> PC.
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# O chip detectado na placa possui 16 MB de flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# O arquivo de captura usa nome maior que FAT 8.3.
CONFIG_FATFS_LFN_HEAP=y

# Captura bruta do console principal em /sdcard/uart0_capture.log.
CONFIG_SD_CAPTURE_SCK_GPIO=4
CONFIG_SD_CAPTURE_MOSI_GPIO=5
CONFIG_SD_CAPTURE_MISO_GPIO=6
CONFIG_SD_CAPTURE_CS_GPIO=7
CONFIG_SD_CAPTURE_SPI_FREQ_KHZ=4000
CONFIG_SD_CAPTURE_STATUS_LED_GPIO=48
CONFIG_SD_CAPTURE_STATUS_LED_BRIGHTNESS=4

# A logger nao inicializa rede sem fio nem Bluetooth.
# CONFIG_BT_ENABLED is not set
